Revit 2024 API
ParameterSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ParameterSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As ParameterSetIterator
Visual C++
public:
virtual ParameterSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
ParameterSet Class
Autodesk.Revit.DB Namespace